#include <a_samp>

// -----------------------------------------------------------------------------

#define LOD 		0
#define LOD_VNITREK 1
#define LOD_POVRCH  2

#define dcmd(%1,%2,%3) if ((strcmp((%3)[1], #%1, true, (%2)) == 0) && ((((%3)[(%2) + 1] == 0) && (dcmd_%1(playerid, "")))||(((%3)[(%2) + 1] == 32) && (dcmd_%1(playerid, (%3)[(%2) + 2]))))) return 1

// -----------------------------------------------------------------------------

new lod[3], bool:Titn = false, Titanic_object = 0;

// -----------------------------------------------------------------------------

forward SwimTitanic();

// -----------------------------------------------------------------------------

dcmd_titanic(playerid, cmdtext[])
{
    #pragma unused cmdtext
    if(IsPlayerConnected(playerid))
	{
		// --------------- |
		if(Titanic_object == 4 && !Titn)
		{
			SetObjectRot(lod[LOD],0.00000000,0.00000000,0.00000000);
			SetObjectPos(lod[LOD],-2303.87719727,2171.10766602,8.71205521);
        	SendClientMessage(playerid, 0xFF0000FF, "[Dark Drift]  {FFFFFF}Титаник был отремонтирован и возвращен в нужное место !");
        	Titanic_object = 0;
        	return false;
		}
		// --------------- |
		if(Titn) return SendClientMessage(playerid, 0xFF0000FF, "[Dark Drift]  {FFFFFF}Титаник плывет, тебе придется подождать.");
		// --------------- |
		else if(!Titn)
		{
	    	SwimTitanic();
	    	Titn = true;
		}
	}
	return 1;
}

// -----------------------------------------------------------------------------

dcmd_tspawn(playerid, cmdtext[])
{
    #pragma unused cmdtext
    if(IsPlayerConnected(playerid))
    {
        SetPlayerPos(playerid,-2329.8872,2290.9641,3.5000);
        SetPlayerFacingAngle(playerid, 179.3452);
        SendClientMessage(playerid, 0xFF0000FF, "[Dark Drift]  {FFFFFF}Вы были доставлены до места, где стоит Титаник");
        if(Titanic_object > 0) SendClientMessage(playerid, 0xFFFFFFFF, "Титаник не отремонтирован.");
    }
    return 1;
}

// -----------------------------------------------------------------------------

public SwimTitanic()
{
    if(!Titn) Titn = true;
    // -------------------------------------------------------------------------
	if(Titanic_object == 0)
	{
	    SendClientMessageToAll(0xFF0000FF, "[Dark Drift]  {FFFFFF}Титаник плывет !");
 		MoveObject(lod[LOD],-2483.35229492,2090.94531250,8.71205521,10,0.00000000,0.00000000,19.85000610);
	}
	// -------------------------------------------------------------------------
	if(Titanic_object == 1) MoveObject(lod[LOD],-3898.20947266,1584.29040527,8.71205521,10,0.00000000,0.00000000,19.84680176);
	// -------------------------------------------------------------------------
	if(Titanic_object == 2)
	{
	    SendClientMessageToAll(0xFF0000FF, "[Dark Drift]  {FFFFFF}Титаник столкнулся с айсбергом !");
		MoveObject(lod[LOD],-4039.61914062,1549.38208008,7.51206398,7,0.00000000,358.01501465,19.84680176);
	}
	// -------------------------------------------------------------------------
	if(Titanic_object == 3) MoveObject(lod[LOD],-4072.75000000,1537.57299805,7.51206398,0.2,0.00000000,270.01147461,15.87683105);
    // -------------------------------------------------------------------------
	if(Titanic_object == 4)
	{
 		MoveObject(lod[LOD],-4072.75000000,1537.57226562,-66.23793030,3,0.00000000,270.01098633,15.87524414);
 		SendClientMessageToAll(0xFF0000FF, "[Dark Drift]  {FFFFFF}Титаник тонет !");
	}
    // -------------------------------------------------------------------------
	return true;
}

// -----------------------------------------------------------------------------

public OnFilterScriptInit()
{
	// -------------------------------------------------------------------------
	
	// -------------------------------------------------------------------------
	
	CreateObject(3886,-2329.84594727,2284.36840820,1.59999919,0.00000000,0.00000000,0.00000000); // Lбvka
	CreateObject(3886,-2329.87377930,2273.88720703,1.59999919,0.00000000,0.00000000,0.00000000); // Lбvka
	CreateObject(3886,-2329.88012695,2263.42382812,1.59999919,0.00000000,0.00000000,0.00000000); // Lбvka
	CreateObject(3886,-2329.87597656,2252.94482422,1.59999919,0.00000000,0.00000000,0.00000000); // Lбvka
	CreateObject(3886,-2329.88110352,2242.48706055,1.59999919,0.00000000,0.00000000,0.00000000); // Lбvka
	CreateObject(3886,-2329.88354492,2232.03833008,1.59999919,0.00000000,0.00000000,0.00000000); // Lбvka
	CreateObject(3886,-2329.87622070,2221.56494141,1.59999919,0.00000000,0.00000000,0.00000000); // Lбvka
	CreateObject(3886,-2329.88110352,2211.09228516,1.59999919,0.00000000,0.00000000,0.00000000); // Lбvka
	CreateObject(3886,-2329.87988281,2200.62280273,1.59999919,0.00000000,0.00000000,0.00000000); // Lбvka
	CreateObject(3886,-2329.87036133,2190.16259766,1.59999919,0.00000000,0.00000000,0.00000000); // Lбvka
	
	CreateObject(897,-3927.38696289,1556.46008301,0.00000000,0.00000000,0.00000000,0.00000000); // Ledovec
	CreateObject(897,-3927.74560547,1551.76367188,2.81999969,0.00000000,0.00000000,0.00000000); // Ledovec
	CreateObject(897,-3924.00610352,1551.47802734,-0.43000031,0.00000000,0.00000000,0.00000000); // Ledovec
	CreateObject(897,-3924.32958984,1547.23999023,-0.43000031,0.00000000,0.00000000,0.00000000); // Ledovec
	CreateObject(897,-3929.12231445,1546.85327148,-0.43000031,0.00000000,0.00000000,0.00000000); // Ledovec
	CreateObject(897,-3919.33325195,1551.12377930,-0.43000031,0.00000000,0.00000000,0.00000000); // Ledovec
	CreateObject(897,-3919.11059570,1554.12524414,-0.43000031,0.00000000,0.00000000,0.00000000); // Ledovec
	CreateObject(897,-3920.09350586,1547.59838867,4.13999939,0.00000000,0.00000000,0.00000000); // Ledovec
	CreateObject(897,-3927.00512695,1546.46508789,4.13999939,0.00000000,0.00000000,0.00000000); // Ledovec
	CreateObject(897,-3923.32055664,1541.33105469,1.63999939,0.00000000,0.00000000,0.00000000); // Ledovec
	CreateObject(897,-3915.47265625,1543.86816406,1.63999939,0.00000000,0.00000000,0.00000000); // Ledovec
	CreateObject(897,-3927.89404297,1562.20983887,-4.56999969,0.00000000,0.00000000,0.00000000); // Ledovec
	
	// -------------------------------------------------------------------------
	
	lod[LOD] 		 = CreateObject(10230,-2303.87719727,2171.10766602,8.71205521,0.00000000,0.00000000,0.00000000); // Loп - Samostatnб
	lod[LOD_VNITREK] = CreateObject(10140,-2289.15234375,2170.05761719,8.86106491,0.00000000,0.00000000,0.00000000); // Loп - Vnitшek
	lod[LOD_POVRCH]  = CreateObject(10231,-2304.77880859,2169.57324219,10.12228012,0.00000000,0.00000000,0.00000000); // Loп - Nбklad
	AttachObjectToObject(lod[LOD_VNITREK],lod[LOD],14.986572,-0.924072,0.120282,0.000000,0.000000,0.000000,1);
	AttachObjectToObject(lod[LOD_POVRCH],lod[LOD],-0.896728,-1.575927,1.429391,0.000000,0.000000,0.000000,1);
	return true;
}

// -----------------------------------------------------------------------------

public OnPlayerSpawn(playerid)
{
	if(IsPlayerConnected(playerid))
	{
    	SendClientMessage(playerid, 0xFF0000FF, "[Dark Drift]  {FFFFFF}Титаник ждет тебя! /tspawn");
	}
	return 1;
}

// -----------------------------------------------------------------------------

public OnPlayerCommandText(playerid, cmdtext[])
{
	dcmd(titanic, 7, cmdtext);
	dcmd(tspawn,  6, cmdtext);
	return false;
}

// -----------------------------------------------------------------------------

public OnObjectMoved(objectid)
{
    if(!IsObjectMoving(lod[LOD]) && Titn != false)
    {
        if(Titanic_object == 4)
        {
            Titn = false;
            SendClientMessageToAll(0xFF0000FF, "[TITANIC]  {FFFFFF}Титаник погрузился на дно");
            return false;
        }
        Titanic_object ++;
        SwimTitanic();
	}
	return 1;
}

// -----------------------------------------------------------------------------
